#pragma once
typedef enum {
  R_ZERO = 0, // 定数の0
  R_AT = 1,   // アセンブラ用に予約
  R_V0 = 2,   // 式の評価と関数の結果
  R_V1 = 3,   // 式の評価と関数の結果
  R_A0 = 4,   // 引数1
  R_A1 = 5,   // 引数2
  R_A2 = 6,   // 引数3
  R_A3 = 7,   // 引数4

  R_T0 = 8, // 一時変数 (呼び出し側で保存不要)
  R_T1 = 9,
  R_T2 = 10,
  R_T3 = 11,
  R_T4 = 12,
  R_T5 = 13,
  R_T6 = 14,
  R_T7 = 15,

  R_S0 = 16, // 一時変数 (呼び出し側で保存必要)
  R_S1 = 17,
  R_S2 = 18,
  R_S3 = 19,
  R_S4 = 20,
  R_S5 = 21,
  R_S6 = 22,
  R_S7 = 23,

  R_T8 = 24, // 一時変数 (呼び出し側で保存不要)
  R_T9 = 25,

  R_K0 = 26, // OS カーネル用に予約
  R_K1 = 27, // OS カーネル用に予約

  R_GP = 28, // グローバル領域へのポインタ
  R_SP = 29, // スタック・ポインタ
  R_FP = 30, // フレーム・ポインタ
  R_RA = 31  // 戻りアドレス
} MipsReg;

const char *reg_to_string(MipsReg r);
